def sleep():
    import time
    time.sleep(5)


def formula():
    print(" ")
    print("Тогда лови рецептик.")
    print('Тебе понадобится:')


def formula_limon_printing():
    formula()
    print('''
	1.500мл сливок (33%, частично можно заменить менее жирными сливками или даже молоком); 
	2.5 куриных яиц (только желтки); 
	3.180гр сахара; 
	4.3 ст.л. лимонной цедры (можно получить мелко натерев лимонную кожуру); 
	5.90мл лимонного сока.''')
    print('''А вот и само приготовление:
	1.Желтки соединить с сахаром и взбить миксером 1-2 минуты. Добавить сливки и включить миксер еще на несколько оборотов - только чтобы ингредиенты соединились.
	2.Перелить массу в миску/кастрюлю и поставить на водяную баню. Готовить 10-15 минут, регулярно помешивая и не давая смеси закипеть. Если сильно нагреется - на 30 секунд снять миску с водяной бани, либо влить в крем пару ложек холодного молока/сливок.''')
    sleep()
    print('''3.Снять с огня и поставить миску с яично-сливочной массой в холодную воду. Охладить пару минут, помешивая. После чего добавить лимонные сок и цедру и еще раз размешать. Перелить в контейнер, пригодный для замораживания, и отправить в морозильную камеру, до готовности. Пару раз можно перемешать, особенно это важно, если часть сливок заменить молоком.
	4.После этого контейнер нужно поставить в морозилку до полного затвердевания мороженого.
	5.Лимонное мороженое готово! Разложить его по креманкам будет гораздо проще, если контейнер постоит несколько минут при комнатной температуре. Приятного аппетита!''')


def print_choco():
    formula()
    print('''
	1.Сливки 40% — 1 стакан;
	2.Сливки 18% — 240 мл;
	3.Сахар — 0, 5 стакана;
	4.Ванильный сахар — 3\4 ч. ложки;
	5.Соль — небольшая щепотка;
	6.Какао — 3 ст. ложки (или шоколадный сироп — 60 мл).''')
    print('''А вот и само приготовление:
	1.Растворите какао в небольшом количестве теплых 18% сливок.
	2.Нагрейте оставшиеся (18%), всыпьте сахар и нагревайте, пока он не растворится, влейте какао и доведите до кипения.
	3.Отставьте остывать.''')
    sleep()
    print('''
	4.В холодную смесь положите ванильный сахар, перемешайте.
	5.40% сливки взбейте с щепоткой соли и введите в остывшую смесь.
	6.Переложите в контейнер мороженицы или емкость, которую вы поставите в морозилку. Приятного аппетита!''')


def print_white():
    formula()
    print('''
	1.4 желтка;
	2.90–100 г мелкокристаллического сахара;
	3.1 стручок ванили;
	4.250 мл молока 6%;
	5.350 мл жирных сливок 38%.''')
    print('''А вот и само приготовление:
	1. Желтки растереть с сахаром добела.
	2. Извлечь семена из палочки ванили.
	3. В сотейнике вскипятить молоко с семенами ванили.''')
    sleep()
    print('''
	4. Влить тонкой струйкой горячее молоко в желтки, непрерывно помешивая.
	5. Вернуть молочно-желтковую смесь на огонь и прогревать, постоянно помешивая, до 80–85°С. Смесь ни в коем случае не должна закипеть, иначе получится молоко с яичными хлопьями. Охладить. Сначала до комнатной температуры, затем в холодильнике не менее часа.
	6. Охлажденные сливки взбить до пышности, затем аккуратно соединить с холодной желтково-молочной смесью. Взбить буквально минуту или две. Должна получиться пышная, но не густая масса (на венчике миксера не держится, «сползает»).''')
    sleep()
    print('''
	7. Переложить мороженое в контейнер и поставить в морозильную камеру на 40–60 минут. Через указанное время достать из морозилки и взбить миксером. Снова убрать в морозильную камеру на 50 минут. Проделать все то же самое по этой схеме 3–4 раза.
	8. Последний раз масса будет твердая, замороженная, не пугайтесь, все идет по плану! Тщательно «разбейте» мороженое ложкой, активно перемешивая.
	Еще раз отправьте в морозильную камеру.''')
    sleep()
    print('''
	9. Через 30–40 минут достать, перемешать, окончательно убрать в морозильную камеру до полного замерзания.
	10. Классический советский пломбир готов! Разложить его по креманкам будет гораздо проще, если контейнер постоит несколько минут при комнатной температуре. Приятного аппетита!''')


def print_coffee_cake():
    formula()
    print('''
	Для теста:
	1.3 белка,
	2.1 стакан рафинированного растительного масла (225г),
	3.0,5 стакана сахара,
	4.1 ст ложка какао (10г),
	5.0,5 стакана муки (80г),
	6.1,5 ч ложки разрыхлителя,
	7.ванилин.
	''')
    sleep()
    print('''
	Для заварной помадки:
	1.3 желтка,
	2.0,5 стакана молока,
	3.1/3 стакана сахара,
	4.1 ч ложка муки.

	Для сливочного суфле:
	1.1 ст ложка растворимого кофе, 
	2.250г молока,
	3.300г 30~35% сливок,
	4.15г желатина,
	5.2/3 стакана мелкого сахара или сахарной пудры.
	''')
    sleep()
    print('''
	Для пропитки:
	1.50г воды,
	2.2 ч ложки коньяка,
	3.2 ч ложки сахара.''')
    print('''
	А вот и само приготовление:
	Тесто
	1.У яиц отделить белки от желтков; желтки отложить.
	2.Миксером взбить белки с сахаром в мягкую пену. Прямо под вращающиеся лопасти тонкой струйкой влить растительное масло. Должна получиться густая кремообразная масса.
	3.Положить муку, какао, разрыхлитель и ванилин и аккуратно размешать ложкой.
	4.В форму d=22~24см положить кружок бумаги и вылить тесто.
	5.Форму сверху затянуть фольгой.Духовку заранее разогреть до t=200~220°C и поставить в неё форму с тестом.
	6.Выпекать до готовности - примерно 35~40 минут.''')
    sleep()
    print('''
	7.Готовность проверять прокалывая деревянной палочкой корж (прокол делать через фольгу).
	8.Готовый корж остудить до тёплого не снимая фольги. 
	9.Затем фольгу снять, корж вынуть из формы.
	10.Форму вымыть, на дно опять положить кружок бумаги. В форму уложить корж, но уже дном вверх.
	11.При желании пропитать корж сиропом - в 50 граммах тёплой кипячёной воды растворить сахар и добавить коньяк.

	Заварная помадка
	1.Когда корж приготовится и будет остывать, сделать заварную помадку.
	2.В маленькой кастрюльке растереть желтки с сахаром. 
	3.Добавить муку, хорошо размешать. 
	4.Затем влить молоко.
	5.Поставить кастрюльку на большой огонь и непрерывно помешивая довести массу до загустения. При правильном и интенсивном помешивании масса не должна пригореть и в ней не должно быть комков. Если комки всё-таки образовались, протереть массу через сито.
	6.Намазать горячую помадку на тёплый корж и оставить остывать до комнатной температуры.
	''')
    sleep()
    print('''
	Сливочное суфле
	1.Желатин замочить на 10 минут в 100г холодного молока.
	2.150г молока разогреть до начала закипания и растворить в нём кофе.
	3.В желатин при интенсивном помешивании влить горячее молоко с кофе.
	4.Если желатин растворится не полностью, то поставить чашку с желатином в миску с кипятком до полного растворения желатина.
	5.Остудить жидкость до комнатной температуры, а затем поставить в холодильник до начала загустения. Масса должна превратиться в лёгкое желе, которое легко мешается ложкой.
	6.Сливки с сахаром взбить до жёсткости. Несколько ложек сливок можно отложить для дальнейшего украшения торта.
	7.В сливки положить желатиновую массу хорошо взбить до равномерного окрашивания.
	8.Быстро выложить сливки на корж, поверх заварной помадки.
	9.Форму с тортом накрыть сверху фольгой или п/э плёнкой, чтобы предохранить от заветривания, и поставить на ночь в холодильник.
	10.Готовый торт вынуть из формы, украсить боковую поверхность и верх. Приятного аппетита!''')


def print_prague_cake():
    formula()
    print('''
	Для теста:
	1.2 яйца,
	2.300г сметаны,
	3.1,5 стакана сахара, 
	4.1,5 стакана муки, 
	5.3 ч ложки какао,
	6.1/2 ч ложки соды,
	7.1/2 ч ложки соли, 
	8.ванилин.
	''')
    sleep()
    print('''
	Для крема:
	1.300г сливочного масла,
	2.1 банка сгущенного молока с какао.

	Для сиропа:
	1.3/4 стакана воды,
	2.3 ст ложки сахара,
	3.1 ст ложка коньяка.
	''')
    sleep()
    print('''
	Для шоколадное глазури:
	1.50~100г шоколада,
	2.50г сливочного масла, 
	3.1 стакан сахарной пудры,
	4.5 ст ложек молока,
	5.1 ст ложка крахмала,
	6.3 ст ложки какао,
	7.ванилин''')
    print('''
	А вот и само приготовление:
	1.Смешать все составляющие для теста.
	2.Выпечь 2 коржа. 
	3.Разрезать коржи пополам и остудить.
	4.Масло сбить со сгущенным молоком с какао. Если сгущенное молоко без добавок, 3 ч ложки какао заварить 2-мя ст ложками кипятка, остудить и вбить в крем.''')
    sleep()
    print('''
	5.Коржи пропитать сиропом и промазать кремом. 
	6.Верх торта намазать кислым вареньем или джемом и облить шоколадной глазурью (вскипятить сливки с сах. пудрой до полного растворения, добавить шоколад, масло, крахмал и какао). 
	7.Торт готов! Приятного аппетита!''')


def print_napoleon_cake():
    formula()
    print('''
	Для теста:
	1.2 стакана муки,
	2.200гр маргарина,
	3.1 стакан сметаны,
	4.1 ст ложка водки
	''')
    sleep()
    print('''
	Для заварного крема:
	1.200г сливочного масла,
	2.0,5 стакана молока,
	3.1 стакан сахара,
	4.1 яйцо,
	5.0,5 порошка ванилина или 2~3ст ложки коньяка
	''')
    sleep()
    print('''
	Для сливочногo крема:
	1.0,5 литра домашней сметаны или сливок,
	2.1 стакан сахара (размолотого в пудру).''')
    print('''
	А вот и само приготовление:
	1.Муку порубить с маргарином.
	2.Влить сметану и водку.
	3.Завернуть в целлофан и положить на холод на 1 час.
	4.Раскатать 6 коржей и выпекать при t=220°С.
	5.Коржи лучше раскатывать прямо на бумаге для выпечки. Если такой бумаги нет, то прямо на противне, не смазывая его.''')
    sleep()
    print('''
	6.Заварной крем:Яйца взбить с сахаром, добавить 1 стакан холодного молока и муку, взбить. Влить эту массу в кипящие 1/2 л молока. Варить до загустения, постоянно помешивая, но не кипятить. Снять с огня, охладить, взбить с мягким маслом и ванилином.
	7.Крем обязательно должен быть заварной, иначе коржи НЕ ПРОПИТАЮТСЯ и будут жесткими. Еще лучше, если чередовать 2 слоя заварного крема, 1 слой - сливочного. В этом случае нужно готовить 2/3 нормы заварного крема и 1/3 нормы - сливочного.
	8.Когда коржи остынут, намазать кремом. Сверху положить что-нибудь плоское (блюдо, поднос, разделочную доску) и хорошенько нажать. Края торта обрезать. Торт украсить и оставить при комнатной температуре на 12~24 часа. Приятного аппетита!''')


def printing_choc():
    formula()
    print('''
	1.Шоколад (черный) — 170 г
	2.Масло сливочное — 60 г
	3.Сахар	— 100 г
	4.Яйцо куриное	— 2 шт
	5.Ванилин — 1 ч. л.
	6.Разрыхлитель теста — 3/4 ч. л.
	7.Соль — 1/4 ч. л.
	8.Сахарная пудра (для присыпки)
	9.Мука — 200 г''')
    print('''
	А вот и само приготовление:
	1.Шоколад растопить с маслом, дать остыть.
	2.Яйца взбить с сахаром, добавить остывший шоколад, муку с разрыхлителем, соль, ванилин, хорошо перемешать и поставить в холод, чтобы масса застыла.
	3.Сформировать шарики и обвалять в сахарной пудре, лучше, если они будут по форме с грецкий орех.''')
    sleep()
    print('''
	4.Сложить на протвень застеленный пекарской бумагой, выпекать при 180 градусов минут 15 (смотреть по своей духовке).
	5.Вот такие вкусняшки получаются. Приятного аппетита!''')


def printing_briliant():
    formula()
    print('''
	1.Масло сливочное (комнатной температуры) — 230 г
	2.Сахарная пудра (важно! не сахар) — 105 г
	3.Мука пшеничная — 330 г
	4.Ванильная эссенция — 0,5 ч. л.
	5.Соль — 0,25 ч. л.
	6.Сахар (для посыпки)
	7.Мак (для посыпки)
	8.Яйцо куриное — 1 шт
	''')
    print('''А вот и само приготовление:
	1.Сливочное масло комнатной температуры хорошо смешиваемым с сахарной пудрой до кремообразной массы. Можно это делать кулинарной лопаткой, а можно и миксером, особо взбивать не нужно.
	2.Добавляем в масляную смесь соль, ванильный экстракт и просеянную муку. 
	3.Замешиваем нежное и мягкое тесто опять же лопаткой или на комбайне.
	4.Формируем из теста небольшие колбаски диаметром 2 см, а вот длину я рекомендую не больше 15-20 см, для дальнейшего удобства. Колбаски из теста отправляем в холодильник до полного застывания, в идеале на ночь. Чем дольше оно простоит в холодильнике, тем удобнее с ним будет работать.''')
    sleep()
    print('''
	5.Достаем застывшие колбаски. Тесто напоминает по структуре застывший пластилин. Яйцо хорошо перемешаем (взбивать не надо) и обильно смажем им каждую колбаску. Дальше поверхность колбасок нужно обильно посыпать сахаром. Еще более удобно рассыпать сахар по поверхности стола и прокачать несколько раз по нему тесто.
	6.Ещё есть альтернативная посыпка - мак.
	7.Приступим к формированию печенья. Каждую колбаску нарезаем небольшими кусочками толщиной 2 см.''')
    sleep()
    print('''
	8.Противень смазываем маслом, аккуратно выкладываем на него заготовки нашего печенья. Ставим в разогретую до 180 градусов духовку на 20-22 минуты. Как только печенье зарумянилось - вынимаем.
	9.Печенье имеет форму усеченного конуса, а свое название получило за сверкающие грани сахара по бокам.
	10. Ну вот и всё, печеньки готовы!Приятного аппетита!''')


def printing_triangle():
    formula()
    print('''
	1.Мука — 300 г
	2.Маргарин (или масло) — 120 г
	3.Молоко — 120 мл
	4.Сахар	— 100 г
	5.Дрожжи (сухие) — 1 ч. л.
	6.Соль (щепотка)''')
    print('''
	А вот и само приготовление:
	1.Маргарин растопить, влить молоко, всыпать муку, дрожжи и соль. Замесить тесто. Оно получается масляным, совершенно не липнет к рукам и к посуде, работать с ним - одно удовольствие! Причем замешивать можно даже ложкой, настолько оно податливое!
	2.Теперь прикрыть его пищевой плёнкой и на часок спрятать в холодильник.''')
    sleep()
    print('''
	3.По истечении часа достать тесто из холодильника и раскатать в пласт толщиной около 5 мм. Посыпать столовой ложкой сахара, не больше, поверьте, этого достаточно! Не надо насыпать больше, раскатать тесто в пласт впоследствии будет невозможно, так как слои будут скользить друг по дружке.
	4.Сложить пополам.''')
    sleep()
    print('''
	5.Раскатать опять до 5 мм толщиной, опять посыпать столовой ложкой сахара, опять сложить. И так ещё 4 раза. 
	6.Посыпая - складывая - раскатывая, мы создаем слоистость теста.
	7.Итак, перед нами в конечном итоге оказывается пласт толщиной 5 мм. Его мы нарезаем треугольниками.
	8.Форма не принципиальна, можно вырезать формочками для печенья, можно квадратиками, кружочками... В общем, как вам нравится.''')
    sleep()
    print('''
	9.Теперь берём треугольничек, обмакиваем одной стороной в сахаре. 
	10.Выкладываем печенье сахарной стороной вверх на застеленный пекарской бумагой противень. Отправляем в разогретую до 180С духовку на 15-20 минут.
	11.Как только печенье станет золотистым, вытаскиваем, перекладываем на тарелочку, чуточку ждем, чтобы остыло, и кушаем! Приятного аппетита!''')


def printing_milkshake():
    formula()
    print('''
	1.100 грамм пломбира,
	2.100 мл молока,
	3.Выбранный тобой топинг.''')
    print('''
	А вот и само приготовление:
	1. Охлажденное молоко налей в чашу блендера.
	2. Добавь топинг и взбей молоко с ним несколько секунд. Затем добавь нарезанное крупными кусочками мороженое и взбивай до однородности.
	3. Разлей готовый коктейль в подготовленные бокалы и сразу подавай. Если хочешь, можно посыпать коктейль шоколадной стружкой. Приятного апетита!''')


def printing_lemonade_gingery():
    formula()
    print('''
	1.50 грамм тросникового сахара,
	2.4 лимона,
	3.50 грамм имбиря,
	4.2 литра воды.''')
    print('''
	А вот и само приготовление:
	1.На умеренном огне раствори в стакане воды сахар, смешай с тертым имбирем и доведи смесь до кипения.
	2.Сними сковородку с огня и дай ей десять минут отдыха, чтобы сироп как следует настоялся на имбире.
	3.После чего добавь к сиропу сок четырех лимонов и оставшуюся воду, перемешай и подавай с большим количеством льда. Приятного апетита!''')


def printing_lemonade_lavender():
    formula()
    print('''
	1.2 столовых ложки сушоных листьев лаванды,
	2.3 лимона,
	3.Пол стакана сахара,
	4.4,5 стакана воды''')
    print('''
	А вот и само приготовление:
	1.  Налей два с половиной стакана воды в сотейник, добавь сахар и сушеную лаванду. Поставь на средний огонь, доведи до кипения, убавь огонь до слабого и вари еще 5 минут. Сними с огня, накрой крышкой и оставь на 1 час.''')
    sleep()
    print('''
	2.  Процеди отвар сквозь сито, чтобы удалить лаванду. Выжми сок из лимонов. Вмешай в отвар лимонный сок, добавь оставшуюся воду, перемешай. Перелей лимонад в кувшин и отправь в холодильник на полчаса.
	3.  Подавай лимонад, разлив по высоким стаканам, с кубиками льда.
		Приятного апетита!''')


def printing_lemonade_green():
    formula()
    print('''
	1.10 яблок,
	2.1 лимон,
	3.4 стебля сельдерея,
	4.1 пучок кормовой капусты''')
    print('''
	А вот и само приготовление:
	1.  Выжми сок из всех ингредиентов.
	2.  Перемешай и сразу подавай.
		Приятного апетита!''')


def printing_lemonade_meantlime():
    formula()
    print('''
	1.Пол пучка свежей мяты,
	2.1 лайм,
	3.1 литр воды,
	4.Сахар и лед.''')
    print('''
	А вот и само приготовление:
	1.  Выжми сок лайма.
	2.  Перемешай в блендере мяту, сахар, сок лайма.
	3.  Разбавь водой.
	4.  Добавь лед.
		Приятного апетита!''')


def printing_lemonade():
    formula()
    print('''
	1.1 кг сахара,
	2.3 лимона,
	3.2 литра воды,''')
    print('''
	А вот и само приготовление:
	1.  Нареж 3 лимона (цедру очисти, но не до конца).
	2.  Добавь сахар.
	3.  Залей горячей водой и доведи до кипения.
	4.  Остуди. Лимонад готов.
		Приятного апетита!''')


def printing_tea_gingery():
    formula()
    print('''
	1.Половина корня имбиря,
	2.Лайм и мед.''')
    print('''
	А вот и само приготовление:
	1. Вскипяти 1 литр воды. Положи в нее половину корня имбиря, предварительно почищенного и мелконарезанного\тертого.
	2. Доведи воду до кипения. После этого отставь с плиты завар. Дай ему постоять 15 мин.''')
    sleep()
    print('''
	3. Выжми лайм и добавь мед, такое кол-во, чтобы твой чай не был сильно сладким. Перемешай и дай напитку настояться еще до 10 мин.
		Приятного чаепития!''')


def printing_tea_rowan():
    formula()
    print('''
	1.3 грамма чорноплодной рябины,
	2.1 столовая ложка черного чая.''')
    print('''
	А вот и само приготовление:
	1.Ошпарь заварочный чайник кипятком. 
	2.Всыпь заварку и положи ягоды рябины.
	3.Залей кипятком и заваривай 5-7 минут. 
	Перед тем как разлить чай по чашкам, советую ложкой размять ягоды прямо в заварочном чайнике. Вкус чая будет намного богаче.
		Приятного чаепития!''')


def printing_tea_chocolate():
    formula()
    print('''
	1.2 чайной ложки сухого молока,
	2.200 мл черного чая,
	3.2 чайной ложки какао
	4.Молотая корица''')
    print('''
	А вот и само приготовление:
	1. Завари черный чай. Оставь настояться на 3-5 минут.
	2. В чашке смешай сухое молоко и какао. Я вобщем-то использую детское сладкое какао, поэтому сахар нам не понадобится. По вкусу можешь добавить корицу.''')
    sleep()
    print('''
	3. Залей сухие ингредиенты горячим чаем и хорошо размешай. Пей сразу. 
	Очень простой и быстрый способ согреться - это выпить чашечку ароматного чая!
		Приятного чаепития!''')


def printing_tea_orange_cinnamon():
    formula()
    print('''
	1.2 столовой ложки меда,
	2.3 чайной ложки крупнолистового черного чая,
	3.2 яблока,
	4.1 апельсин,
	5.1 щепотка молотой корицы.''')
    print('''
	А вот и само приготовление:
	1. Поставь кипятить 500 мл воды. Апельсин нареж кружками, затем каждый кружок нареж на восемь частей. Посыпь корицей и оставь на 5 минут, чтобы апельсин пропитался.
	2. Яблоки нареж дольками или кубиками.
	3. Чайник ополосни кипящей водой, положи в него яблоки, апельсины.''')
    sleep()
    print('''
	4. Насыпь заварку, залей кипятком и закрой крышкой.
	5. Укутай чайник полотенцем или специальным чехлом и оставь настояться на 15- 20 минут.
	По истечению этого времени можно смело разливать ароматный чаек и наслаждаться неповторимым вкусом горячего напитка. Сладость чая можно регулировать медом. И не забудь про любимые сладости. :D
		Приятного чаепития!''')


def printing_tea_health():
    formula()
    print('''
	1.Половинка лайма,
	2.Половина стручка ванили,
	3.Горсть шиповника,
	4.1 апельсин,
	5.1 палочка корицы.''')
    print('''
	А вот и само приготовление:
	1. Возьми горсть шиповника.
	3. Нареж апельсин.
	3. Выдави из лайма сок.
	4. Все положи в чайник и залей кипятком. 
	5. Дай настояться 15 минут.
		Приятного чаепития!''')